# Brewfile - Install with: brew bundle --file=~/dotfiles/Brewfile
# Generated from currently installed packages

# Taps
tap "homebrew/bundle"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "planetscale/tap"
tap "stripe/stripe-cli"
tap "supabase/tap"

# Core CLI tools
brew "coreutils"
brew "fzf"
brew "gh"
brew "jq"
brew "ripgrep"
brew "tmux"

# Version managers (pick your preferred approach)
brew "asdf"           # Multi-language version manager

# Languages & runtimes
brew "node@18"
brew "python@3.11"
brew "openjdk"

# Package managers
brew "pnpm"
brew "yarn"
brew "uv"             # Fast Python package installer

# Ruby
brew "chruby"
brew "ruby-install"

# Databases
brew "mysql", restart_service: :changed
brew "redis", restart_service: :changed

# Dev services
brew "mailhog"
brew "overmind"       # Process manager (Procfile)

# Media
brew "ffmpeg"
brew "imagemagick"

# Security
brew "gnupg"
brew "pinentry-mac"

# Cloud & APIs
brew "flyctl"
brew "stripe/stripe-cli/stripe"
brew "supabase/tap/supabase"
brew "planetscale/tap/pscale"

# Casks (GUI apps tracked by Homebrew)
cask "gpg-suite"
cask "ngrok"
cask "notunes"

# Cursor/VSCode extensions (optional - Cursor syncs these itself)
# Uncomment if you want declarative extension management:
# vscode "bradlc.vscode-tailwindcss"
# vscode "dbaeumer.vscode-eslint"
# vscode "esbenp.prettier-vscode"
# vscode "github.github-vscode-theme"
# vscode "eamodio.gitlens"
